In [2]:
#6-11-2020

import pandas as pd
import numpy as np

my_product = [
    
    ('saeed' , 'cooder' , 'saudi arabia' , 50000),
    ('mohamed' , 'frontend', 'egypt' , 140000),
    ('mohab' , 'backend' , 'tunis'  , 110000),
    ('sara' , 'design' , 'algeria' , 90000),
    ('mahmoud' , 'coders', 'sudan' , 60000),
    ('hind' , 'backend' , 'maly' , 70000),
    ('yara' , 'software' , 'dubai', 110000),
    ('mohab' , 'applications', 'kuwait', 100000),
    ('nawaf' , 'backend' , 'saudi', 100000),
    ('mahmoud' , 'fronend' , 'egypt' , 50000)]

data = pd.DataFrame( my_product , columns=['name' , 'job' , 'country' , 'salary'])

data.head()

      name       job       country  salary
0    saeed    cooder  saudi arabia   50000
1  mohamed  frontend         egypt  140000
2    mohab   backend         tunis  110000
3     sara    design       algeria   90000
4  mahmoud    coders         sudan   60000

In [9]:
data['name'].sort_values()

5       hind
4    mahmoud
9    mahmoud
2      mohab
7      mohab
1    mohamed
8      nawaf
0      saeed
3       sara
6       yara
Name: name, dtype: object

In [10]:
data['name'].sort_values().head()

5       hind
4    mahmoud
9    mahmoud
2      mohab
7      mohab
Name: name, dtype: object

In [18]:
x = data[['name' , 'job']]
x

      name           job
0    saeed        cooder
1  mohamed      frontend
2    mohab       backend
3     sara        design
4  mahmoud        coders
5     hind       backend
6     yara      software
7    mohab  applications
8    nawaf       backend
9  mahmoud       fronend

In [25]:
data['name']

0      saeed
1    mohamed
2      mohab
3       sara
4    mahmoud
5       hind
6       yara
7      mohab
8      nawaf
9    mahmoud
Name: name, dtype: object

In [24]:
data[3:15]

      name           job  country  salary
3     sara        design  algeria   90000
4  mahmoud        coders    sudan   60000
5     hind       backend     maly   70000
6     yara      software    dubai  110000
7    mohab  applications   kuwait  100000
8    nawaf       backend    saudi  100000
9  mahmoud       fronend    egypt   50000

In [26]:
data['name'].get(0)

'saeed'

In [28]:
data['name'].get(5)

'hind'

In [31]:
data.get('name')

0      saeed
1    mohamed
2      mohab
3       sara
4    mahmoud
5       hind
6       yara
7      mohab
8      nawaf
9    mahmoud
Name: name, dtype: object

In [32]:
data.get('job')

0          cooder
1        frontend
2         backend
3          design
4          coders
5         backend
6        software
7    applications
8         backend
9         fronend
Name: job, dtype: object

In [34]:
data.get(['name' , 'country'])

      name       country
0    saeed  saudi arabia
1  mohamed         egypt
2    mohab         tunis
3     sara       algeria
4  mahmoud         sudan
5     hind          maly
6     yara         dubai
7    mohab        kuwait
8    nawaf         saudi
9  mahmoud         egypt

In [35]:
data.count()

name       10
job        10
country    10
salary     10
dtype: int64

In [36]:
data['name'].count()

10

In [37]:
len(data)

10